tutorials/fluidSolidInteraction/conjugateHeatTransfer/flowOverSlab/constant/fluid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0 0 0)
    (2 0 0)
    (2 4 0)
    (0 4 0)
    (0 0 0.1)
    (2 0 0.1)
    (2 4 0.1)
    (0 4 0.1)
    (3 0 0)
    (3 4 0)
    (3 0 0.1)
    (3 4 0.1)
    (10 0 0)
    (10 4 0)
    (10 0 0.1)
    (10 4 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 1) simpleGrading (0.28 10 1)
    hex (1 8 9 2 5 10 11 6) (40 40 1) simpleGrading (1 10 1)
    hex (8 12 13 9 10 14 15 11) (72 40 1) simpleGrading (10 10 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (13 15 14 12)
        );
    }
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (2 6 11 9)
            (9 11 15 13)
        );
    }
    interface
    {
        type wall;
        faces
        (
            (8 10 5 1)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (12 14 10 8)
        );
    }
    symmetry
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (1 2 9 8)
            (5 10 11 6)
            (8 9 13 12)
            (10 14 15 11)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
