tutorials/fluidSolidInteraction/conjugateHeatTransfer/flowOverSlab/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (2 -0.25 0)
    (3 -0.25 0)
    (3 0 0)
    (2 0 0)
    (2 -0.25 0.1)
    (3 -0.25 0.1)
    (3 0 0.1)
    (2 0 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    interface
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    sides
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    symmetry
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
