tutorials/fluidSolidInteraction/conjugateHeatTransfer/flowOverSlab/constant/fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

rho             rho [1 -3 0 0 0 0 0] 1.0;

nu              nu [0 2 -1 0 0 0 0] 0.001;

beta            beta [0 0 0 -1 0 0 0] 0;

TRef            TRef [0 0 0 1 0 0 0] 300;

Pr              Pr [0 0 0 0 0 0 0] 0.01;

Prt             Prt [0 0 0 0 0 0 0] 0.9;

// Note on fluid specific heat capacity
// ks/kf = 5 set Cp = 100.0
// ks/kf = 20 set Cp = 25.0
Cp              Cp [0 2 -2 -1 0 0 0] 25.0;


// ************************************************************************* //
