tutorials/fluidSolidInteraction/conjugateHeatTransfer/flowOverSlab/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel     thermalSolid;

thermalSolidCoeffs
{
    // Maximum number of correctors
    nCorrectors    1000;

    // Solution tolerance
    solutionTolerance 1e-08;

    // Alternative solution tolerance
    alternativeTolerance 1e-08;

    // Write frequency for the residuals
    infoFrequencyT  100;
}


// ************************************************************************* //
