tutorials/fluidSolidInteraction/conjugateHeatTransfer/flowOverSlab/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    interface
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }
    bottom
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }
    symmetry
    {
        type            empty;
    }
}


// ************************************************************************* //
