tutorials/fluidSolidInteraction/conjugateHeatTransfer/flowOverSlab/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    interface
    {
        type            mixedTemperature;
        refValue        uniform 300;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        value           uniform 300;
    }
    ground
    {
        type 	        fixedValue;
	value           uniform 310;
    }
    sides
    {
        type 	        zeroGradient;
    }
    symmetry
    {
        type            empty;
    }
}


// ************************************************************************* //
